import React from "react";
import '../../../../css/style.css'
import car from '../../../../images/page_1/main/floatStyles.png'

export const CarFloat = ()=>{
    return(
        <div className={"car-float"}>
            <div className="car-float-div">
                <img className={"car-float-div-img"} src={car} alt={"car"}/>
            </div>
            <div>
                BMW является аббревиатурой названия Bayerische Motoren Werke AG (с нем. — «Баварские моторные заводы»), хотя в последнем по правилам немецкого языка Motorenwerke должно писаться слитно[8].
                По-русски название «BMW» произносится «бэ-эм-вэ́», что близко к немецкому произношению; изредка встречается написание «БМВ». Существует также несколько «неофициальных» названий: из англоязычного произношения аббревиатуры «би-эм-дабл-ю» для мотоциклов фирмы исторически сложилось название «бимер» (англ. beemer), для автомобилей — похожее, но не равнозначное «биммер» (англ. bimmer)[9]. В России для обозначения марки могут также применяться названия «бэха», «биммер», «бумер»[10], в Греции — «beba», в арабских странах — «BM»[11]. Автомобили также могут называться соответственно их серии, например для 5-й серии — «пятёрка» (нем. Fünfer).
                В логотипе компании чёрное кольцо было заимствовано от логотипа завода авиационных моторов Раппа. Белые и голубые сектора указывают на флаг и герб Баварии, в свою очередь основанных на гербе рода Виттельсбахов, правивших Баварией с конца XII по начало XX века
                После Первой мировой войны по условиям Версальского мирного договора 1919 года было запрещено производство самолётов в Германии, вследствие чего BMW перешла на производство сельскохозяйственной техники, предметов домашнего обихода и тормозов для поездов. В 1923 году на фабрике в Мюнхене был выпущен первый мотоцикл BMW[13]. В 1924 году на самолёте, оснащённом двигателями BMW, состоялся первый межконтинентальный полёт в Персию. В 1926 году гидросамолёт Rohrbach Ro VII с двигателями BMW VI устанавливает пять мировых рекордов. В 1927 году было установлено 87 мировых авиарекордов, 29 из них — на самолётах с двигателями BMW.
                В 1933 году компания начала производство авиационных двигателей для Luftwaffe, в частности приобрела лицензию на выпуск моторов Hornet. Также началось производство автомобилей 300-й серии, в частности очень успешный BMW 328, представленный в сентябре 1936 года[13]. В июне 1939 года Siemens продал свой машиностроительный филиал BMW, включавший Бранденбургские моторостроительные заводы[de], а также заводы и фабрики, лаборатории и испытательные полигоны в Шпандау, Нидербарниме, Басдорфе и Зюльсдорфе. Кроме этого, на государственные средства был построен новый завод близ Мюнхена. На базе приобретённых предприятий в дополнение к уже имеющимся двигателестроительным заводам были созданы: фабрика авиационных и ракетных двигателей (Flugzeugturbinenfabrik) и подразделение ракетной техники и ракетного вооружения (BMW-Raketenabteilung) с исследовательским центром в Зюльсдорфе и производством в Шпандау. К осени 1940 года на ракетных заводах BMW в Шпандау и Нидербарниме было занято только немецких граждан около 10 тыс. человек[14] плюс военнопленные, к которым вскоре присоединились остарбайтеры. В 1942 году под давлением Имперского управления вооружений пост председателя правления занял Фриц Хилле[15][13].
            </div>
        </div>
    )
}